module.exports = {

  // 通用错误
  0: '内部错误',
  1: '该字段重复',
  2: '该数据不存在',
  3: '参数不能为空',
  4: '该数据已存在',
  5: '请重新登录',
  6: '登录失败',


  // system 100 - 199
  100: '需要有两个 id',
  101: '同年只能有一条数据',
  102: '该年度已存在 SOW，不可编辑',
  103: '该年度缺少货币汇率',
  104: 'Team Brief 不能存在空格',

  // sow 200 - 399
  200: 'SOW Level 在该年不存在',
  201: 'SOW name 已存在',
  202: 'Position name 已存在',
  203: 'SOW 中已存在该 Position',
  204: '该 position FTE 超过 1',
  205: '该年度已存在 SOW',
  206: 'SOW 开启年份错误',

  // position 400 - 799
  400: 'SOW 为历史版本或已批准，不可编辑',
};

